In [62]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [63]:
df = pd.read_csv('Black Friday Sale.csv')

# Data Cleaning and Preprocessing

In [64]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [65]:
df. isna(). sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [66]:
df.shape

(550068, 12)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [68]:
df.describe

<bound method NDFrame.describe of         User_ID Product_ID Gender    Age  Occupation City_Category  \
0       1000001  P00069042      F   0-17          10             A
1       1000001  P00248942      F   0-17          10             A
2       1000001  P00087842      F   0-17          10             A
3       1000001  P00085442      F   0-17          10             A
4       1000002  P00285442      M    55+          16             C
...         ...        ...    ...    ...         ...           ...
550063  1006033  P00372445      M  51-55          13             B
550064  1006035  P00375436      F  26-35           1             C
550065  1006036  P00375436      F  26-35          15             B
550066  1006038  P00375436      F    55+           1             C
550067  1006039  P00371644      F  46-50           0             B

       Stay_In_Current_City_Years  Marital_Status  Product_Category_1  \
0                               2               0                   3
1                               2               0                   1
2                               2               0                  12
3                               2               0                  12
4                              4+               0                   8
...                           ...             ...                 ...
550063                          1               1                  20
550064                          3               0                  20
550065                         4+               1                  20
550066                          2               0                  20
550067                         4+               1                  20

        Product_Category_2  Product_Category_3  Purchase
0                      NaN                 NaN      8370
1                      6.0                14.0     15200
2                      NaN                 NaN      1422
3                     14.0                 NaN      1057
4                      NaN                 NaN      7969
...                    ...                 ...       ...
550063                 NaN                 NaN       368
550064                 NaN                 NaN       371
550065                 NaN                 NaN       137
550066                 NaN                 NaN       365
550067                 NaN                 NaN       490

[550068 rows x 12 columns]>

In [69]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [70]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].replace('4+',"4")
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].astype(int)
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years      int32
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [71]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

User_ID : Categorical Ordinal
Product_ID : Categorical Nominal
Gender : Categorical Nominal
Age : Categorical Ordinal
Occupation : Categorical Nominal
City_Category : Categorical Nominal
Stay_In_Current_City_Years : Metric Discrete
Marital_Status : Categorical Nominal
Product_Category_1 : Categorical Nominal
Product_Category_2 : Categorical Nominal
Product_Category_3 : Categorical Nominal
Purchase : Metric continous

In [72]:
df['Gender'].unique()

array(['F', 'M'], dtype=object)

In [73]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [74]:
df['Occupation'].unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6], dtype=int64)

In [75]:
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [76]:
df['Marital_Status'].unique()

array([0, 1], dtype=int64)

In [77]:
df['Product_Category_1'].unique()

array([ 3,  1, 12,  8,  5,  4,  2,  6, 14, 11, 13, 15,  7, 16, 18, 10, 17,
        9, 20, 19], dtype=int64)

In [78]:
df['Product_Category_2'].unique()

array([nan,  6., 14.,  2.,  8., 15., 16., 11.,  5.,  3.,  4., 12.,  9.,
       10., 17., 13.,  7., 18.])

In [79]:
df['Product_Category_3'].unique()

array([nan, 14., 17.,  5.,  4., 16., 15.,  8.,  9., 13.,  6., 12.,  3.,
       18., 11., 10.])

# Frequency Table

In [83]:
gender_freq = df.Gender.value_counts()
gender_freq = pd.DataFrame({'Gender': gender_freq.index, 'Frequency': gender_freq.values})
gender_freq

  Gender  Frequency
0      M     414259
1      F     135809

In [85]:
age_freq = df.Age.value_counts()
age_freq = pd.DataFrame({'Age': age_freq.index, 'Frequency': age_freq.values})
age_freq

     Age  Frequency
0  26-35     219587
1  36-45     110013
2  18-25      99660
3  46-50      45701
4  51-55      38501
5    55+      21504
6   0-17      15102

In [86]:
occupation_freq = df.Occupation.value_counts()
occupation_freq = pd.DataFrame({'Occupation': occupation_freq.index, 'Frequency': occupation_freq.values})
occupation_freq

    Occupation  Frequency
0            4      72308
1            0      69638
2            7      59133
3            1      47426
4           17      40043
5           20      33562
6           12      31179
7           14      27309
8            2      26588
9           16      25371
10           6      20355
11           3      17650
12          10      12930
13           5      12177
14          15      12165
15          11      11586
16          19       8461
17          13       7728
18          18       6622
19           9       6291
20           8       1546

In [87]:
city_cat_freq = df.City_Category.value_counts()
city_cat_freq = pd.DataFrame({'City_Category': city_cat_freq.index, 'Frequency': city_cat_freq.values})
city_cat_freq

  City_Category  Frequency
0             B     231173
1             C     171175
2             A     147720

In [88]:
marital_status_freq = df.Marital_Status.value_counts()
marital_status_freq = pd.DataFrame({'Marital_Status': marital_status_freq.index, 'Frequency': marital_status_freq.values})
marital_status_freq

   Marital_Status  Frequency
0               0     324731
1               1     225337

In [89]:
product_cat_1_freq = df.Product_Category_1.value_counts()
product_cat_1_freq = pd.DataFrame({'Product_Category_1': product_cat_1_freq.index, 'Frequency': product_cat_1_freq.values})
product_cat_1_freq

    Product_Category_1  Frequency
0                    5     150933
1                    1     140378
2                    8     113925
3                   11      24287
4                    2      23864
5                    6      20466
6                    3      20213
7                    4      11753
8                   16       9828
9                   15       6290
10                  13       5549
11                  10       5125
12                  12       3947
13                   7       3721
14                  18       3125
15                  20       2550
16                  19       1603
17                  14       1523
18                  17        578
19                   9        410

In [90]:
product_cat_2_freq = df.Product_Category_2.value_counts()
product_cat_2_freq = pd.DataFrame({'Product_Category_2': product_cat_2_freq.index, 'Frequency': product_cat_2_freq.values})
product_cat_2_freq

    Product_Category_2  Frequency
0                  8.0      64088
1                 14.0      55108
2                  2.0      49217
3                 16.0      43255
4                 15.0      37855
5                  5.0      26235
6                  4.0      25677
7                  6.0      16466
8                 11.0      14134
9                 17.0      13320
10                13.0      10531
11                 9.0       5693
12                12.0       5528
13                10.0       3043
14                 3.0       2884
15                18.0       2770
16                 7.0        626

In [91]:
product_cat_3_freq = df.Product_Category_3.value_counts()
product_cat_3_freq = pd.DataFrame({'Product_Category_3': product_cat_3_freq.index, 'Frequency': product_cat_3_freq.values})
product_cat_3_freq

    Product_Category_3  Frequency
0                 16.0      32636
1                 15.0      28013
2                 14.0      18428
3                 17.0      16702
4                  5.0      16658
5                  8.0      12562
6                  9.0      11579
7                 12.0       9246
8                 13.0       5459
9                  6.0       4890
10                18.0       4629
11                 4.0       1875
12                11.0       1805
13                10.0       1726
14                 3.0        613